<template>
  <div v-loading="listDescription.loading">
    <dynamic-virtual-list
      :list="listDescription.displayList"
      :loading="listDescription.loading"
      :error="listDescription.err"
      v-slot="slotProps"
      @updateLoading="bool => (listDescription.loading = bool)"
      :perPage="3"
      :maxHeight="600"
    >
      <!-- 此处可以使用div或ul li组合 -->
      <!-- <ul>
        <li v-for="item in slotProps.renderList" :key="item">
          <div style="font-size: 34px">
            {{ item }}
          </div>
        </li>
      </ul> -->
      <div v-for="item in slotProps.renderList" :key="item">
        <div style="font-size: 34px">
          {{ item }}
        </div>
      </div>
    </dynamic-virtual-list>
  </div>
</template>

<script setup lang="ts">
import DynamicVirtualList from "./DynamicVirtualList.vue";
import { onMounted, reactive } from "vue";

const listDescription = reactive({
  displayList: [] as any[],
  loading: false,
  err: false,
});
onMounted(() => {
  listDescription.loading = true;
  // 模拟加载数据
  listDescription.displayList = [
    `今天的事今天翻篇，
   明天还要忙着可爱。
   ——《晴天》`,
    `我偷偷地碰了你一下，
   不料你像蒲公英一样散开，
   此后到处都是你的模样。
   ——《答案》`,
    `人在异乡，不要生病。
   好好吃饭，就不会想家。
   ——《清白之年》`,
    `我会变得更好，
  因为你，但不是为了你。
  ——《Like That》`,
    `“做人不可以太低下，
   因为父亲曾把你举过头顶。”
   “难过时也要记得笑，
   因为妈妈许的愿望是希望你天天开心”
  ——《Like That》`,
    `青春就是这样，
  好像是无论怎样度过都会被浪费。
  那么，不如浪费在你身上。
  ——《浪费》
  
  长的是深夜，短的是人生。
  在你成长的这些年里，
  真正放不下的，只有筷子。
  ——《深夜的歌》
  
  一生太短了
  想吃的就去买
  想的人就去找
  如果能快乐就不要等
  ——《紫阳花》`,
    `人说，
  林深时见鹿，
  海蓝时见鲸，
  梦醒时见你。
  可实际，
  林深时雾起，
  海蓝时浪涌，
  梦醒时也许未见鹿，
  未见鲸，亦未见你。
  但是，
  鹿踏雾而来，
  鲸随浪儿起，
  你没回头，又怎知我没来过。
  ——《That girl》`,
    `数学里有句话
  过程错了
  就是错了
  ——《我们》
  
  你剥开一个很酸的橘子而感到后悔了。
  可对于橘子来说，那是它的一切。
  ——《最喜欢不是我》
  
  你把性格交给星座，
  把努力交给鸡汤，
  把运气交给锦鲤，
  然后对自己说“听过许多道理，
  但依然过不好这一生。
   倒也是，过得好了才有鬼呢。
  ——《梦一场》
  
  昨晚我爸来我房间
  看见我在看星星
  他站了一会儿说“生活很累吗”
  我敷衍了一句说“ 还行”
  他转头看向星星说 “你没有小时候那么活泼了”
  ——《Asphyxia》
  
  人就是这么奇怪，
  受了天大的委屈都不会吭声，
  但听到安慰的话却会泣不成声。
  ——《木头的心》
  
  有部电影中，记得有这样的对话
  “你愿意为我而死吗？”
  “我愿意”
  “不，那太简单了，换个问题，你愿意为我而活吗？”
  ——《心安理得》
  
  以前喜欢喝可乐，
  但我现在不喜欢了，
  不爱就是不爱了，
  可乐没有错，我也没有错。
  ——《可乐》
  
  考59分比考零分更难过，
  最痛苦的不是不曾拥有，
  而是差一点就可以。
  ——《淘汰》`,
    `长大后，
  当你踏上火车的那一刻，
  你可能还没意识到，
  从此后，
  你的故乡便只有了冬，
  在也没有春,秋了。
  ——《平凡之路》
  
  想成为你睡觉前数的最后一只羊。
  开心时会听歌
  难过时会听歌
  思念时会听歌
  感伤时会听歌
  ...
  每种时刻我们都能在歌曲中找到心情
  也能在网易云的热评中感同身受
  这样挺好
  至少说明我们并不孤独
  ——网易云音乐热评《晚安》`,
    `今天的事今天翻篇，
   明天还要忙着可爱。
   ——《晴天》`,
    `我偷偷地碰了你一下，
   不料你像蒲公英一样散开，
   此后到处都是你的模样。
   ——《答案》`,
    `人在异乡，不要生病。
   好好吃饭，就不会想家。
   ——《清白之年》`,
    `我会变得更好，
  因为你，但不是为了你。
  ——《Like That》`,
    `“做人不可以太低下，
   因为父亲曾把你举过头顶。”
   “难过时也要记得笑，
   因为妈妈许的愿望是希望你天天开心”
  ——《Like That》`,
    `青春就是这样，
  好像是无论怎样度过都会被浪费。
  那么，不如浪费在你身上。
  ——《浪费》
  
  长的是深夜，短的是人生。
  在你成长的这些年里，
  真正放不下的，只有筷子。
  ——《深夜的歌》
  
  一生太短了
  想吃的就去买
  想的人就去找
  如果能快乐就不要等
  ——《紫阳花》`,
    `人说，
  林深时见鹿，
  海蓝时见鲸，
  梦醒时见你。
  可实际，
  林深时雾起，
  海蓝时浪涌，
  梦醒时也许未见鹿，
  未见鲸，亦未见你。
  但是，
  鹿踏雾而来，
  鲸随浪儿起，
  你没回头，又怎知我没来过。
  ——《That girl》`,
    `数学里有句话
  过程错了
  就是错了
  ——《我们》
  
  你剥开一个很酸的橘子而感到后悔了。
  可对于橘子来说，那是它的一切。
  ——《最喜欢不是我》
  
  你把性格交给星座，
  把努力交给鸡汤，
  把运气交给锦鲤，
  然后对自己说“听过许多道理，
  但依然过不好这一生。
   倒也是，过得好了才有鬼呢。
  ——《梦一场》
  
  昨晚我爸来我房间
  看见我在看星星
  他站了一会儿说“生活很累吗”
  我敷衍了一句说“ 还行”
  他转头看向星星说 “你没有小时候那么活泼了”
  ——《Asphyxia》
  
  人就是这么奇怪，
  受了天大的委屈都不会吭声，
  但听到安慰的话却会泣不成声。
  ——《木头的心》
  
  有部电影中，记得有这样的对话
  “你愿意为我而死吗？”
  “我愿意”
  “不，那太简单了，换个问题，你愿意为我而活吗？”
  ——《心安理得》
  
  以前喜欢喝可乐，
  但我现在不喜欢了，
  不爱就是不爱了，
  可乐没有错，我也没有错。
  ——《可乐》
  
  考59分比考零分更难过，
  最痛苦的不是不曾拥有，
  而是差一点就可以。
  ——《淘汰》`,
    `长大后，
  当你踏上火车的那一刻，
  你可能还没意识到，
  从此后，
  你的故乡便只有了冬，
  在也没有春,秋了。
  ——《平凡之路》
  
  想成为你睡觉前数的最后一只羊。
  开心时会听歌
  难过时会听歌
  思念时会听歌
  感伤时会听歌
  ...
  每种时刻我们都能在歌曲中找到心情
  也能在网易云的热评中感同身受
  这样挺好
  至少说明我们并不孤独
  ——网易云音乐热评《晚安》`,
  ];
  setTimeout(() => {
    listDescription.loading = false;
  }, 1000);
});
</script>
